#+TITLE: Building Abstractions with Data
#+AUTHOR: Lucas S. Vieira
#+LANGUAGE: en-us
#+OPTIONS: toc:nil
#+STARTUP: latexpreview showeverything inlineimages
#+PROPERTY: header-args:scheme :cache yes :noweb strip-export :exports both

* Exercise 2.6

#+name: church_numbers
#+begin_src scheme
;; Given by exercise
(define zero (lambda (f) (lambda (x) x)))

(define (add-1 n)
  (lambda (f)
    (lambda (x) (f ((n f) x)))))


;; Answer
(define one (lambda (f) (lambda (x) (f x))))
(define two (lambda (f) (lambda (x) (f (f x)))))

(define (plus a b)
  (lambda (f)
    (lambda (x) ((a f) ((b f) x)))))


(define (church->number f)
  ((f 1+) 0))
#+end_src

Tests:

#+begin_src scheme :results output
<<church_numbers>>

(define (run-test)
  (let ((tests (list zero                         ; 0
                     one                          ; 1
                     two                          ; 2
                     (add-1 two)                  ; 3
                     (add-1 (add-1 two))          ; 4
                     (plus one two)               ; 3
                     (plus one (add-1 two))       ; 4
                     (plus (add-1 two) one)       ; 4
                     (plus (add-1 two)            ; 7
                           (add-1 (add-1 two)))
                     (plus two (plus two two))))) ; 6
    (map (lambda (f)
           (newline)
           (display (church->number f)))
         tests)))

(run-test)
#+end_src

#+RESULTS[7a02c36f9b079186f26d6ec00c7734ec111df169]:
#+begin_example

0
1
2
3
4
3
4
4
7
6
#+end_example

* Exercise 2.9

Given definition:

#+name: interval_width
#+begin_src scheme
<<interval_sub>>

(define (width i)
  (/ (- (upper-bound i)
        (lower-bound i))
     2))
#+end_src

We define a few intervals and their sum and multiplication, for
experimentation purposes.

#+name: interval_examples
#+begin_src scheme
<<interval_width>>

(define a (make-interval 0 5))
(define b (make-interval 2 4))
(define z (add-interval a b))
(define w (mul-interval a b))
#+end_src

By doing normal-order evaluation, we can verify the values of widths
for =a=, =b= and =z=:

#+begin_example
> (width a)
> (/ (- 5 0) 2)
> 5/2

> (width b)
> (/ (- 4 2) 2)
> 2

> (width z)
> (/ (- 9 2) 2)
> 7/2
#+end_example

It seems that the width of the sum of two intervals =a= and =b= correspond
to doubling the width of those intervals, summing them, and then
dividing the result by two again. We can write a procedure for this
behaviour.

#+name: interval_sum_width
#+begin_src scheme
<<interval_examples>>

(define (sum-width x y)
  (/ (+ (* 2 (width x))
        (* 2 (width y)))
     2))
#+end_src

By testing, we verify that this is indeed true:

#+begin_src scheme :results output
<<interval_sum_width>>

(let ((width-z (width z))
      (width-sum (sum-width a b)))
  (display width-z)
  (display " = ")
  (display width-sum)
  (display "?    ")
  (display (= width-z width-sum))
  (newline))
#+end_src

#+RESULTS[3267be305966869e1c43b06211ef5b56d027603a]:
: 7/2 = 7/2?    #t

Indeed, this is not true for multiplications of intervals:

#+begin_src scheme :results output
<<interval_sum_width>>

(let ((width-w (width w))
      (width-sum (sum-width a b)))
  (display width-w)
  (display " = ")
  (display width-sum)
  (display "?    ")
  (display (= width-w width-sum))
  (newline))
#+end_src

#+RESULTS[c0d31db70d42beefa59b91b31e3756e13908671a]:
: 10 = 7/2?    #f
